ERP_DZGU_EXTENTION/Documents/БИТ_ВводНачальныхОстатковСертификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>БИТ_ВводНачальныхОстатковСертификации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БИТ_Карантин</xr:Item>
				<xr:Item>AccumulationRegister.БИТ_СертификацияОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/РезервыТоваровОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваровОрганизаций</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/Documents/БИТ_ВводНачальныхОстатковСертификации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Товары.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Остатки.Номенклатура КАК Номенклатура,
		                      |	Остатки.Характеристика КАК Характеристика,
		                      |	Остатки.Серия КАК Серия,
		                      |	Остатки.Назначение КАК Назначение,
		                      |	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |ПОМЕСТИТЬ ОстаткиОтправителя
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
		                      |		СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |	ИЗ
		                      |		РегистрНакопления.ТоварыОрганизаций.Остатки(
		                      |				&Граница,
		                      |				Организация = &ОрганизацияОтправитель
		                      |					И АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		                      |					И ВидЗапасов.ТипЗапасов В (&ДоступныеТипыЗапасов)
		                      |					И (ВидЗапасов.ВладелецТовара = &ВладелецТовара
		                      |						ИЛИ &ПоВсемВладельцам)) КАК Остатки
		                      |	ГДЕ
		                      |		НЕ(Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
		                      |					И &СкрыватьПодакцизныеТовары)
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение,
		                      |		СУММА(Остатки.КоличествоОстаток)
		                      |	ИЗ
		                      |		РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
		                      |				&Граница,
		                      |				Организация = &ОрганизацияОтправитель
		                      |					И АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		                      |					И ВидЗапасов.ТипЗапасов В (&ДоступныеТипыЗапасов)
		                      |					И (ВидЗапасов.ВладелецТовара = &ВладелецТовара
		                      |						ИЛИ &ПоВсемВладельцам)) КАК Остатки
		                      |	ГДЕ
		                      |		НЕ(Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
		                      |					И &СкрыватьПодакцизныеТовары)
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение) КАК Остатки
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Остатки.Номенклатура,
		                      |	Остатки.Характеристика,
		                      |	Остатки.Серия,
		                      |	Остатки.Назначение
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура КАК Номенклатура,
		                      |	ОстаткиОтправителя.Серия КАК Серия,
		                      |	СУММА(ОстаткиОтправителя.КоличествоОстаток) КАК Количество
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия,
		                      |	СУММА(-ОстаткиОтправителя.КоличествоОстаток)
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия,
		                      |	СУММА(ОстаткиОтправителя.КоличествоОстаток)
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И НЕ ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Номенклатура,
		                      |	Серия
		                      |АВТОУПОРЯДОЧИВАНИЕ");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОрганизацияОтправитель", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ОтрицательныеОстатки", Ложь);
	Запрос.УстановитьПараметр("СкрыватьПодакцизныеТовары", Ложь);
	Запрос.УстановитьПараметр("ОблагаетсяНДСУПокупателя", Ложь);
	
	ДоступныеТипыЗапасов = Новый Массив();
	ВладелецТовара = Неопределено;
	
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Товар);
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	Запрос.УстановитьПараметр("ДоступныеТипыЗапасов", ДоступныеТипыЗапасов);
	Запрос.УстановитьПараметр("ВладелецТовара", ВладелецТовара);
	Запрос.УстановитьПараметр("ПоВсемВладельцам", Не ЗначениеЗаполнено(ВладелецТовара));
	
	ДатаЗаполнения = ?(ЗначениеЗаполнено(Объект.Дата), КонецДня(Объект.Дата), ТекущаяДатаСеанса());
	Граница = Новый Граница(ДатаЗаполнения, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Граница", Граница);
	
	Результат = Запрос.Выполнить();
	Объект.Товары.Загрузить(Результат.Выгрузить());

КонецПроцедуры
